docs/tail-recursion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-08 Mon 14:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tail Recursion</title>
<meta name="author" content="Mattox Beckman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tail Recursion</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge91dcc4">1. Objectives</a></li>
<li><a href="#org7fd5c1e">2. Function calls and frames</a>
<ul>
<li><a href="#orga514866">2.1. Tail calls</a></li>
<li><a href="#orgdc85c0d">2.2. Tail Code</a></li>
</ul>
</li>
<li><a href="#orgf73254f">3. Accumulators</a></li>
<li><a href="#orgda278dd">4. How to write a tail recursive function</a></li>
<li><a href="#org191af19">5. Problems</a></li>
</ul>
</div>
</div>
<p>
There is a special form of recursion called <i>tail recursion</i> that can be compiled to a loop in the machine
code.  This can save a significant amount of memory if the code needs to make a lot of recursive calls, and in
a functional language like <span class="sc">Haskell</span> this optimization can make the difference between the code working or
running out of memory.
</p>

<div id="outline-container-orge91dcc4" class="outline-2">
<h2 id="orge91dcc4"><span class="section-number-2">1.</span> Objectives</h2>
<div class="outline-text-2" id="text-1">
<p>
When you are done with this chapter, you will&#x2026;
</p>
<ul class="org-ul">
<li>identify subexpressions that are in tail position,</li>
<li>explain the advantages of tail-recursive functions compared to direct-style, and</li>
<li>convert direct-style functions to tail-recursive functions.</li>
</ul>
</div>
</div>


<div id="outline-container-org7fd5c1e" class="outline-2">
<h2 id="org7fd5c1e"><span class="section-number-2">2.</span> Function calls and frames</h2>
<div class="outline-text-2" id="text-2">
<p>
When a program calls a function, the computer allocates memory for the particular instance of that call.
This memory is called a <i>stack frame</i> or sometimes an <i>activation record</i>.
</p>

<p>
For example, suppose we have the following Haskell code:
</p>

<pre class="code"><code><span style="color: #c678dd;">foo</span> x <span style="color: #dcaeea;">=</span>
  <span style="color: #51afef;">let</span> a <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">10</span>
      b <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">20</span>
  <span style="color: #51afef;">in</span> a <span style="color: #dcaeea;">+</span> b <span style="color: #dcaeea;">+</span> bar x
<span style="color: #c678dd;">bar</span> x <span style="color: #dcaeea;">=</span>
  <span style="color: #51afef;">let</span> a <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">30</span>
      b <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">40</span>
  <span style="color: #51afef;">in</span> a <span style="color: #dcaeea;">+</span> b <span style="color: #dcaeea;">+</span> baz x
<span style="color: #c678dd;">baz</span> x <span style="color: #dcaeea;">=</span>
  <span style="color: #51afef;">let</span> a <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">50</span>
      b <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">60</span>
  <span style="color: #51afef;">in</span> a <span style="color: #dcaeea;">+</span> b <span style="color: #dcaeea;">+</span> x
</code></pre>

<p>
If we call <code>foo 10</code>, the program will allocate a frame for <code>foo</code>.  When <code>foo</code>
calls <code>bar</code>, the program allocates a frame for <code>bar</code>, and when <code>bar</code> called
<code>baz</code> a frame gets allocated for <code>baz</code> too.
</p>

<p>
The important thing to note is that while <code>baz</code> is running, the frames for <code>foo</code> and
<code>bar</code> are still in memory, since they are waiting for the results of <code>baz</code>.
</p>

<p>
When a function is recursive, we can end up with a lot of frames.  Take this factorial code
for example:
</p>

<pre class="code"><code><span style="color: #c678dd;">fact</span> <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">1</span>
<span style="color: #c678dd;">fact</span> n <span style="color: #dcaeea;">=</span> n <span style="color: #dcaeea;">*</span> fact (n<span style="color: #dcaeea;">-</span><span style="color: #da8548; font-weight: bold;">1</span>)
</code></pre>

<p>
Computing the factorial of 100 will require 100 frames.
</p>
</div>

<div id="outline-container-orga514866" class="outline-3">
<h3 id="orga514866"><span class="section-number-3">2.1.</span> Tail calls</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Now consider this code.
</p>

<pre class="code"><code><span style="color: #c678dd;">foo</span> x <span style="color: #dcaeea;">=</span>
  <span style="color: #51afef;">let</span> a <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">10</span>
      b <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">20</span>
  <span style="color: #51afef;">in</span> bar (a <span style="color: #dcaeea;">+</span> b <span style="color: #dcaeea;">+</span> x)
<span style="color: #c678dd;">bar</span> x <span style="color: #dcaeea;">=</span>
  <span style="color: #51afef;">let</span> a <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">30</span>
      b <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">40</span>
  <span style="color: #51afef;">in</span> baz (a <span style="color: #dcaeea;">+</span> b <span style="color: #dcaeea;">+</span> x)
<span style="color: #c678dd;">baz</span> x <span style="color: #dcaeea;">=</span>
  <span style="color: #51afef;">let</span> a <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">50</span>
      b <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">60</span>
  <span style="color: #51afef;">in</span> a <span style="color: #dcaeea;">+</span> b <span style="color: #dcaeea;">+</span> x
</code></pre>

<p>
When <code>foo</code> calls <code>bar</code>, note that whatever <code>bar</code> returns will be the value for <code>foo</code> as well.  Similarly,
when <code>bar</code> calls <code>baz</code>, whatever <code>baz</code> return will be the return value for <code>bar</code>.  The function <code>foo</code> will not
need to keep track of its variables after calling <code>bar</code> since it will not be using them again, and likewise when
<code>bar</code> calls <code>baz</code>.
</p>

<p>
So, instead of keeping those stack frames around, the compiler will allow <code>bar</code> to use the same memory that
<code>foo</code> was using, and in turn allow <code>baz</code> to use that same memory as well once <code>bar</code> calls <code>baz</code>.  The function
calls get eliminated and replaced by straight-line code.
</p>

<p>
The question is: <i>how do we know when it&rsquo;s safe to do this</i>?  The answer is that we can
eliminate the function call if the call is in <i>tail position</i>.
</p>
</div>
</div>

<div id="outline-container-orgdc85c0d" class="outline-3">
<h3 id="orgdc85c0d"><span class="section-number-3">2.2.</span> Tail Code</h3>
<div class="outline-text-3" id="text-2-2">
<p>
There are certain kinds of expressions that have subexpressions that will become the value of the whole expression
if evaluated.  These subexpressions are said to be in tail position.  Consider this code:
</p>

<pre class="code"><code><span style="color: #51afef;">if</span> a <span style="color: #dcaeea;">&gt;</span> b <span style="color: #51afef;">then</span> c <span style="color: #51afef;">else</span> d

<span style="color: #51afef;">let</span> e <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">10</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">20</span>
 <span style="color: #51afef;">in</span> f

<span style="color: #c678dd;">foo</span> <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">1</span>
<span style="color: #c678dd;">foo</span> n <span style="color: #dcaeea;">=</span> foo (n<span style="color: #dcaeea;">-</span><span style="color: #da8548; font-weight: bold;">1</span>)
</code></pre>

<p>
The variables <code>c</code>, <code>d</code>, and <code>f</code> are in tail position.  The expressions <code>a&gt;b</code>, <code>10+20</code>, and <code>n-1</code> are not in
tail position.  If <code>a&gt;b</code> is true, and <code>c</code> has value 99, then the value of the whole <code>if</code> expression will be 99.
</p>

<p>
Note that not every expression has subexpressions that are in tail position.
</p>

<p>
Here is a non-exhaustive list of tail subexpressions:
</p>
<ul class="org-ul">
<li>The <i>then</i> and <i>else</i> branches of an <code>if</code> expression</li>
<li>The return values in a <code>case</code> expression</li>
<li>The body of a <code>let</code> expression</li>
<li>The return value of a function</li>
</ul>

<p>
If the expression that is in tail position happens to be a function call, then we call it a <i>tail call</i>.
The call <code>foo (n-1)</code> is a tail call.
</p>
</div>
</div>
</div>
