tail-recursion.org
* Accumulators

In direct-style recursion, the function makes all the calls and traverses the data structure.  Once it hits the
end of the data structure (or base case), it returns to the caller and performs the computations "on the way out".

Consider this function that sums up the elements of a list.

#+begin_src haskell
sum [] = 0
sum (x:xs) = x + sum xs
#+end_src

If we apply =sum= to the list =[2,3,4,5,6]=, =sum= will traverse to the end of the list, and then do all the
adding as things get returned.  We can trace the execution this way, where each line is the next call or
return:

#+begin_src haskell -n
sum [2,3,4,5,6]
= 2 + sum [3,4,5,6]
= 2 + 3 + sum [4,5,6]
= 2 + 3 + 4 + sum [5,6]
= 2 + 3 + 4 + 5 + sum [6]
= 2 + 3 + 4 + 5 + 6 + sum []
= 2 + 3 + 4 + 5 + 6 + 0
= 2 + 3 + 4 + 5 + 6
= 2 + 3 + 4 + 11
= 2 + 3 + 15
= 2 + 18
= 20
#+end_src

If the function is in tail form, then we need to do the computation as we make the tail calls.  This usually
requires an extra parameter to keep track of the computation as we go.  For example:

#+begin_src haskell
tsum [] a = a
tsum (x:xs) a = tsum xs (x+a)
#+end_src

If we call =tsum [2,3,4,5,6] 0= it will look like this:

#+begin_src haskell -n
tsum [2,3,4,5,6] 0
= tsum [3,4,5,6] 2
= tsum [4,5,6] 5
= tsum [5,6] 9
= tsum [6] 14
= tsum [] 20
= 20
#+end_src

Notice that the computation happens "on the way in", and when we reach the base case the computation is complete.

* How to write a tail recursive function

There are four steps:

1. Add an accumulator parameter to your function.
2. The base case returns the accumulator.  It is okay if you do some computation on it.
3. The recursive case calls with an updated value for the accumulator.  Once the code makes
   the recursive call it *cannot do anything else* once it returns or else it is not it tail position.
4. When calling the tail function initially, pass in the result that should get returned by the base case.
   (E.g., for =tsum= we called it with a 0.  If was a product we would have passed in =1=)

We often like to create a helper function that does the recursion, and have the main function be responsible
for passing in the initial value.  Here is what =tsum= would look like:

#+begin_src haskell
tsum xx = aux xx 0
  where aux []     a = a
        aux (x:xs) a = aux xs (x+a)
#+end_src

