docs/tail-recursion.html

<div id="outline-container-orgf73254f" class="outline-2">
<h2 id="orgf73254f"><span class="section-number-2">3.</span> Accumulators</h2>
<div class="outline-text-2" id="text-3">
<p>
In direct-style recursion, the function makes all the calls and traverses the data structure.  Once it hits the
end of the data structure (or base case), it returns to the caller and performs the computations &ldquo;on the way out&rdquo;.
</p>

<p>
Consider this function that sums up the elements of a list.
</p>

<pre class="code"><code><span style="color: #c678dd;">sum</span> <span style="color: #ECBE7B;">[]</span> <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span style="color: #c678dd;">sum</span> (x<span style="color: #ECBE7B;">:</span>xs) <span style="color: #dcaeea;">=</span> x <span style="color: #dcaeea;">+</span> sum xs
</code></pre>

<p>
If we apply <code>sum</code> to the list <code>[2,3,4,5,6]</code>, <code>sum</code> will traverse to the end of the list, and then do all the
adding as things get returned.  We can trace the execution this way, where each line is the next call or
return:
</p>

<pre class="code"><code><span class="linenr"> 1: </span><span style="color: #c678dd;">sum</span> [<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>]
<span class="linenr"> 2: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> sum [<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>]
<span class="linenr"> 3: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> sum [<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>]
<span class="linenr"> 4: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #dcaeea;">+</span> sum [<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>]
<span class="linenr"> 5: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">5</span> <span style="color: #dcaeea;">+</span> sum [<span style="color: #da8548; font-weight: bold;">6</span>]
<span class="linenr"> 6: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">5</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">6</span> <span style="color: #dcaeea;">+</span> sum <span style="color: #ECBE7B;">[]</span>
<span class="linenr"> 7: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">5</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">6</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span class="linenr"> 8: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">5</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">6</span>
<span class="linenr"> 9: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">11</span>
<span class="linenr">10: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">15</span>
<span class="linenr">11: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">+</span> <span style="color: #da8548; font-weight: bold;">18</span>
<span class="linenr">12: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">20</span>
</code></pre>

<p>
If the function is in tail form, then we need to do the computation as we make the tail calls.  This usually
requires an extra parameter to keep track of the computation as we go.  For example:
</p>

<pre class="code"><code><span style="color: #c678dd;">tsum</span> <span style="color: #ECBE7B;">[]</span> a <span style="color: #dcaeea;">=</span> a
<span style="color: #c678dd;">tsum</span> (x<span style="color: #ECBE7B;">:</span>xs) a <span style="color: #dcaeea;">=</span> tsum xs (x<span style="color: #dcaeea;">+</span>a)
</code></pre>

<p>
If we call <code>tsum [2,3,4,5,6] 0</code> it will look like this:
</p>

<pre class="code"><code><span class="linenr">1: </span><span style="color: #c678dd;">tsum</span> [<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>] <span style="color: #da8548; font-weight: bold;">0</span>
<span class="linenr">2: </span><span style="color: #dcaeea;">=</span> tsum [<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>] <span style="color: #da8548; font-weight: bold;">2</span>
<span class="linenr">3: </span><span style="color: #dcaeea;">=</span> tsum [<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>] <span style="color: #da8548; font-weight: bold;">5</span>
<span class="linenr">4: </span><span style="color: #dcaeea;">=</span> tsum [<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>] <span style="color: #da8548; font-weight: bold;">9</span>
<span class="linenr">5: </span><span style="color: #dcaeea;">=</span> tsum [<span style="color: #da8548; font-weight: bold;">6</span>] <span style="color: #da8548; font-weight: bold;">14</span>
<span class="linenr">6: </span><span style="color: #dcaeea;">=</span> tsum <span style="color: #ECBE7B;">[]</span> <span style="color: #da8548; font-weight: bold;">20</span>
<span class="linenr">7: </span><span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">20</span>
</code></pre>

<p>
Notice that the computation happens &ldquo;on the way in&rdquo;, and when we reach the base case the computation is complete.
</p>
</div>
</div>

<div id="outline-container-orgda278dd" class="outline-2">
<h2 id="orgda278dd"><span class="section-number-2">4.</span> How to write a tail recursive function</h2>
<div class="outline-text-2" id="text-4">
<p>
There are four steps:
</p>

<ol class="org-ol">
<li>Add an accumulator parameter to your function.</li>
<li>The base case returns the accumulator.  It is okay if you do some computation on it.</li>
<li>The recursive case calls with an updated value for the accumulator.  Once the code makes
the recursive call it <b>cannot do anything else</b> once it returns or else it is not it tail position.</li>
<li>When calling the tail function initially, pass in the result that should get returned by the base case.
(E.g., for <code>tsum</code> we called it with a 0.  If was a product we would have passed in <code>1</code>)</li>
</ol>

<p>
We often like to create a helper function that does the recursion, and have the main function be responsible
for passing in the initial value.  Here is what <code>tsum</code> would look like:
</p>

<pre class="code"><code><span style="color: #c678dd;">tsum</span> xx <span style="color: #dcaeea;">=</span> aux xx <span style="color: #da8548; font-weight: bold;">0</span>
  <span style="color: #51afef;">where</span> aux <span style="color: #ECBE7B;">[]</span>     a <span style="color: #dcaeea;">=</span> a
        aux (x<span style="color: #ECBE7B;">:</span>xs) a <span style="color: #dcaeea;">=</span> aux xs (x<span style="color: #dcaeea;">+</span>a)
</code></pre>
</div>
</div>
