tail-recursion.org
* Problems

Here is some code written in direct style.  Try converting them to tail recursion.  The answers are below.

#+begin_src haskell
prod [] = 1
prod (x:xs) = x * prod xs

fact 0 = 1
fact n = n * fact (n-1)

filter f [] = []
filter f (x:xs) = if f x then x : rest
                         else rest
    where rest = filter f xs
#+end_src

#+html: <details>
#+html: <summary>solution for prod</summary>
#+begin_src haskell
prod xx = aux xx 1
  where aux []     a = a
        aux (x:xs) a = prod xs (x*a)
#+end_src
#+html: </details>

#+html: <details>
#+html: <summary>solution for fact</summary>
#+begin_src haskell
fact n = aux n 1
  where aux 0 a = a
        aux m a = aux (m-1) (m*a)
#+end_src
#+html: </details>

#+html: <details>
#+html: <summary>solution for filter</summary>
#+begin_src haskell
filter f xx = aux xx []
  where aux []     a = reverse a  -- We need to reverse the list to preserve the original order
        aux (x:xs) a = if f x
                         then aux xs (x:a)
                         else aux xs a

                         -- or --

filter f xx = aux (reverse xx) [] -- We can reverse the input first if we like.
  where aux []     a = a
        aux (x:xs) a = if f x
                         then aux xs (x:a)
                         else aux xs a
#+end_src
#+html: </details>

* End :noexport:
;; Local Variables:
;; eval: (add-hook 'after-save-hook  #'org-tufte-export-to-file nil t)
;; End:
