docs/tail-recursion.html

<div id="outline-container-org191af19" class="outline-2">
<h2 id="org191af19"><span class="section-number-2">5.</span> Problems</h2>
<div class="outline-text-2" id="text-5">
<p>
Here is some code written in direct style.  Try converting them to tail recursion.  The answers are below.
</p>

<pre class="code"><code><span style="color: #c678dd;">prod</span> <span style="color: #ECBE7B;">[]</span> <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">1</span>
<span style="color: #c678dd;">prod</span> (x<span style="color: #ECBE7B;">:</span>xs) <span style="color: #dcaeea;">=</span> x <span style="color: #dcaeea;">*</span> prod xs

<span style="color: #c678dd;">fact</span> <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">1</span>
<span style="color: #c678dd;">fact</span> n <span style="color: #dcaeea;">=</span> n <span style="color: #dcaeea;">*</span> fact (n<span style="color: #dcaeea;">-</span><span style="color: #da8548; font-weight: bold;">1</span>)

<span style="color: #c678dd;">filter</span> f <span style="color: #ECBE7B;">[]</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">[]</span>
<span style="color: #c678dd;">filter</span> f (x<span style="color: #ECBE7B;">:</span>xs) <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">if</span> f x <span style="color: #51afef;">then</span> x <span style="color: #ECBE7B;">:</span> rest
                         <span style="color: #51afef;">else</span> rest
    <span style="color: #51afef;">where</span> rest <span style="color: #dcaeea;">=</span> filter f xs
</code></pre>

<details>
<summary>solution for prod</summary>
<pre class="code"><code><span style="color: #c678dd;">prod</span> xx <span style="color: #dcaeea;">=</span> aux xx <span style="color: #da8548; font-weight: bold;">1</span>
  <span style="color: #51afef;">where</span> aux <span style="color: #ECBE7B;">[]</span>     a <span style="color: #dcaeea;">=</span> a
        aux (x<span style="color: #ECBE7B;">:</span>xs) a <span style="color: #dcaeea;">=</span> prod xs (x<span style="color: #dcaeea;">*</span>a)
</code></pre>
</details>

<details>
<summary>solution for fact</summary>
<pre class="code"><code><span style="color: #c678dd;">fact</span> n <span style="color: #dcaeea;">=</span> aux n <span style="color: #da8548; font-weight: bold;">1</span>
  <span style="color: #51afef;">where</span> aux <span style="color: #da8548; font-weight: bold;">0</span> a <span style="color: #dcaeea;">=</span> a
        aux m a <span style="color: #dcaeea;">=</span> aux (m<span style="color: #dcaeea;">-</span><span style="color: #da8548; font-weight: bold;">1</span>) (m<span style="color: #dcaeea;">*</span>a)
</code></pre>
</details>

<details>
<summary>solution for filter</summary>
<pre class="code"><code><span style="color: #c678dd;">filter</span> f xx <span style="color: #dcaeea;">=</span> aux xx <span style="color: #ECBE7B;">[]</span>
  <span style="color: #51afef;">where</span> aux <span style="color: #ECBE7B;">[]</span>     a <span style="color: #dcaeea;">=</span> reverse a  <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">We need to reverse the list to preserve the original order</span>
        aux (x<span style="color: #ECBE7B;">:</span>xs) a <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">if</span> f x
                         <span style="color: #51afef;">then</span> aux xs (x<span style="color: #ECBE7B;">:</span>a)
                         <span style="color: #51afef;">else</span> aux xs a

                         <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">or --</span>

<span style="color: #c678dd;">filter</span> f xx <span style="color: #dcaeea;">=</span> aux (reverse xx) <span style="color: #ECBE7B;">[]</span> <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">We can reverse the input first if we like.</span>
  <span style="color: #51afef;">where</span> aux <span style="color: #ECBE7B;">[]</span>     a <span style="color: #dcaeea;">=</span> a
        aux (x<span style="color: #ECBE7B;">:</span>xs) a <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">if</span> f x
                         <span style="color: #51afef;">then</span> aux xs (x<span style="color: #ECBE7B;">:</span>a)
                         <span style="color: #51afef;">else</span> aux xs a
</code></pre>
</details>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mattox Beckman</p>
<p class="date">Created: 2022-08-08 Mon 14:28</p>
</div>
</body>
</html>
